In [105]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import seaborn as sns

In [106]:
credit=pd.read_csv("credit_record.csv")
credit.head()

        ID  MONTHS_BALANCE STATUS
0  5001711               0      X
1  5001711              -1      0
2  5001711              -2      0
3  5001711              -3      0
4  5001712               0      C

In [107]:
credit.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1048575 entries, 0 to 1048574
Data columns (total 3 columns):
 #   Column          Non-Null Count    Dtype
---  ------          --------------    -----
 0   ID              1048575 non-null  int64
 1   MONTHS_BALANCE  1048575 non-null  int64
 2   STATUS          1048575 non-null  object
dtypes: int64(2), object(1)
memory usage: 24.0+ MB

In [108]:
credit.isnull().sum()

ID                0
MONTHS_BALANCE    0
STATUS            0
dtype: int64

In [109]:
df= pd.read_csv("application_record.csv")
df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_MOBIL,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,1,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,1,0,1,1,Sales staff,1.0

In [110]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 18 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_MOBIL           438557 non-null  int64
 13  FLAG_WORK_PHONE      438557 non-null  int64
 14  FLAG_PHONE           438557 non-null  int64
 15  FLAG_EMAIL           438557 non-null  int64
 16  OCCUPATION_TYPE      304354 non-null  object
 17  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(8), object(8)
memory usage: 60.2+ MB

In [111]:
df.isnull().sum()

ID                          0
CODE_GENDER                 0
FLAG_OWN_CAR                0
FLAG_OWN_REALTY             0
CNT_CHILDREN                0
AMT_INCOME_TOTAL            0
NAME_INCOME_TYPE            0
NAME_EDUCATION_TYPE         0
NAME_FAMILY_STATUS          0
NAME_HOUSING_TYPE           0
DAYS_BIRTH                  0
DAYS_EMPLOYED               0
FLAG_MOBIL                  0
FLAG_WORK_PHONE             0
FLAG_PHONE                  0
FLAG_EMAIL                  0
OCCUPATION_TYPE        134203
CNT_FAM_MEMBERS             0
dtype: int64

In [112]:
df["OCCUPATION_TYPE"].value_counts()

Laborers                 78240
Core staff               43007
Sales staff              41098
Managers                 35487
Drivers                  26090
High skill tech staff    17289
Accountants              15985
Medicine staff           13520
Cooking staff             8076
Security staff            7993
Cleaning staff            5845
Private service staff     3456
Low-skill Laborers        2140
Secretaries               2044
Waiters/barmen staff      1665
Realty agents             1041
HR staff                   774
IT staff                   604
Name: OCCUPATION_TYPE, dtype: int64

In [113]:
df['CODE_GENDER'].value_counts()

F    294440
M    144117
Name: CODE_GENDER, dtype: int64

In [114]:
credit.nunique()

ID                45985
MONTHS_BALANCE       61
STATUS                8
dtype: int64

In [115]:

df.nunique()

ID                     438510
CODE_GENDER                 2
FLAG_OWN_CAR                2
FLAG_OWN_REALTY             2
CNT_CHILDREN               12
AMT_INCOME_TOTAL          866
NAME_INCOME_TYPE            5
NAME_EDUCATION_TYPE         5
NAME_FAMILY_STATUS          5
NAME_HOUSING_TYPE           6
DAYS_BIRTH              16379
DAYS_EMPLOYED            9406
FLAG_MOBIL                  1
FLAG_WORK_PHONE             2
FLAG_PHONE                  2
FLAG_EMAIL                  2
OCCUPATION_TYPE            18
CNT_FAM_MEMBERS            13
dtype: int64

In [116]:
df.drop('FLAG_MOBIL',axis=1,inplace=True)

In [117]:
df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,0,0,NaN,2.0
1,5008805,M,Y,Y,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,0,0,NaN,2.0
2,5008806,M,Y,Y,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,0,0,0,Security staff,2.0
3,5008808,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,0,1,1,Sales staff,1.0
4,5008809,F,N,Y,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,0,1,1,Sales staff,1.0

In [118]:
df['OCCUPATION_TYPE'].fillna(value='Other', inplace=True)
df['OCCUPATION_TYPE'].value_counts()

Other                    134203
Laborers                  78240
Core staff                43007
Sales staff               41098
Managers                  35487
Drivers                   26090
High skill tech staff     17289
Accountants               15985
Medicine staff            13520
Cooking staff              8076
Security staff             7993
Cleaning staff             5845
Private service staff      3456
Low-skill Laborers         2140
Secretaries                2044
Waiters/barmen staff       1665
Realty agents              1041
HR staff                    774
IT staff                    604
Name: OCCUPATION_TYPE, dtype: int64

In [119]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 438557 entries, 0 to 438556
Data columns (total 17 columns):
 #   Column               Non-Null Count   Dtype
---  ------               --------------   -----
 0   ID                   438557 non-null  int64
 1   CODE_GENDER          438557 non-null  object
 2   FLAG_OWN_CAR         438557 non-null  object
 3   FLAG_OWN_REALTY      438557 non-null  object
 4   CNT_CHILDREN         438557 non-null  int64
 5   AMT_INCOME_TOTAL     438557 non-null  float64
 6   NAME_INCOME_TYPE     438557 non-null  object
 7   NAME_EDUCATION_TYPE  438557 non-null  object
 8   NAME_FAMILY_STATUS   438557 non-null  object
 9   NAME_HOUSING_TYPE    438557 non-null  object
 10  DAYS_BIRTH           438557 non-null  int64
 11  DAYS_EMPLOYED        438557 non-null  int64
 12  FLAG_WORK_PHONE      438557 non-null  int64
 13  FLAG_PHONE           438557 non-null  int64
 14  FLAG_EMAIL           438557 non-null  int64
 15  OCCUPATION_TYPE      438557 non-null  object
 16  CNT_FAM_MEMBERS      438557 non-null  float64
dtypes: float64(2), int64(7), object(8)
memory usage: 56.9+ MB

In [120]:
df['FLAG_OWN_REALTY'].value_counts()

Y    304074
N    134483
Name: FLAG_OWN_REALTY, dtype: int64

In [121]:
df['CODE_GENDER']=df['CODE_GENDER'].map({'F':0,'M':1})
df['FLAG_OWN_CAR']=df['FLAG_OWN_CAR'].map({'N':0,'Y':1})
df['FLAG_OWN_REALTY']=df['FLAG_OWN_REALTY'].map({'Y':0,'N':1})

In [122]:
df.head()

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,DAYS_EMPLOYED,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS
0,5008804,1,1,0,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,0,0,Other,2.0
1,5008805,1,1,0,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,-4542,1,0,0,Other,2.0
2,5008806,1,1,0,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,-1134,0,0,0,Security staff,2.0
3,5008808,0,0,0,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,0,1,1,Sales staff,1.0
4,5008809,0,0,0,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,-3051,0,1,1,Sales staff,1.0

In [123]:
df['DAYS_EMPLOYED'].value_counts()

 365243    75329
-218         262
-1678        251
-249         241
-978         240
           ...
-13529         1
-10223         1
-8917          1
-11429         1
-8105          1
Name: DAYS_EMPLOYED, Length: 9406, dtype: int64

In [124]:
df.drop('DAYS_EMPLOYED',axis=1,inplace=True)

Label Good or Bad Customers

In [127]:
credit['target'] = credit['STATUS']
credit['target'].replace('X', 0, inplace=True)
credit['target'].replace('C', 0, inplace=True)
credit['target'] = credit['target'].astype(int)
credit.loc[credit['target']>=1,'target']=1

target_df = pd.DataFrame(credit.groupby('ID')['target'].agg(max)).reset_index()

In [149]:
dff= pd.merge(df, target_df, how='inner', on='ID')
dff

,ID,CODE_GENDER,FLAG_OWN_CAR,FLAG_OWN_REALTY,CNT_CHILDREN,AMT_INCOME_TOTAL,NAME_INCOME_TYPE,NAME_EDUCATION_TYPE,NAME_FAMILY_STATUS,NAME_HOUSING_TYPE,DAYS_BIRTH,FLAG_WORK_PHONE,FLAG_PHONE,FLAG_EMAIL,OCCUPATION_TYPE,CNT_FAM_MEMBERS,target
0,5008804,1,1,0,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,1,0,0,Other,2.0,1
1,5008805,1,1,0,0,427500.0,Working,Higher education,Civil marriage,Rented apartment,-12005,1,0,0,Other,2.0,1
2,5008806,1,1,0,0,112500.0,Working,Secondary / secondary special,Married,House / apartment,-21474,0,0,0,Security staff,2.0,0
3,5008808,0,0,0,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,0,1,1,Sales staff,1.0,0
4,5008809,0,0,0,0,270000.0,Commercial associate,Secondary / secondary special,Single / not married,House / apartment,-19110,0,1,1,Sales staff,1.0,0
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
36452,5149828,1,1,0,0,315000.0,Working,Secondary / secondary special,Married,House / apartment,-17348,0,0,0,Managers,2.0,1
36453,5149834,0,0,0,0,157500.0,Commercial associate,Higher education,Married,House / apartment,-12387,0,1,1,Medicine staff,2.0,1
36454,5149838,0,0,0,0,157500.0,Pensioner,Higher education,Married,House / apartment,-12387,0,1,1,Medicine staff,2.0,1
36455,5150049,0,0,0,0,283500.0,Working,Secondary / secondary special,Married,House / apartment,-17958,0,0,0,Sales staff,2.0,1
36456,5150337,1,0,0,0,112500.0,Working,Secondary / secondary special,Single / not married,Rented apartment,-9188,0,0,0,Laborers,1.0,1

In [150]:
dff.info()

<class 'pandas.core.frame.DataFrame'>
Int64Index: 36457 entries, 0 to 36456
Data columns (total 17 columns):
 #   Column               Non-Null Count  Dtype
---  ------               --------------  -----
 0   ID                   36457 non-null  int64
 1   CODE_GENDER          36457 non-null  int64
 2   FLAG_OWN_CAR         36457 non-null  int64
 3   FLAG_OWN_REALTY      36457 non-null  int64
 4   CNT_CHILDREN         36457 non-null  int64
 5   AMT_INCOME_TOTAL     36457 non-null  float64
 6   NAME_INCOME_TYPE     36457 non-null  object
 7   NAME_EDUCATION_TYPE  36457 non-null  object
 8   NAME_FAMILY_STATUS   36457 non-null  object
 9   NAME_HOUSING_TYPE    36457 non-null  object
 10  DAYS_BIRTH           36457 non-null  int64
 11  FLAG_WORK_PHONE      36457 non-null  int64
 12  FLAG_PHONE           36457 non-null  int64
 13  FLAG_EMAIL           36457 non-null  int64
 14  OCCUPATION_TYPE      36457 non-null  object
 15  CNT_FAM_MEMBERS      36457 non-null  float64
 16  target               36457 non-null  int32
dtypes: float64(2), int32(1), int64(9), object(5)
memory usage: 4.9+ MB

In [140]:
dff.columns

Index(['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN',
       'AMT_INCOME_TOTAL', 'NAME_INCOME_TYPE', 'NAME_EDUCATION_TYPE',
       'NAME_FAMILY_STATUS', 'NAME_HOUSING_TYPE', 'DAYS_BIRTH',
       'FLAG_WORK_PHONE', 'FLAG_PHONE', 'FLAG_EMAIL', 'OCCUPATION_TYPE',
       'CNT_FAM_MEMBERS', 'target'],
      dtype='object')

In [154]:
X=dff[['ID', 'CODE_GENDER', 'FLAG_OWN_CAR', 'FLAG_OWN_REALTY', 'CNT_CHILDREN','AMT_INCOME_TOTAL','DAYS_BIRTH','FLAG_WORK_PHONE', 'FLAG_PHONE', 'FLAG_EMAIL','CNT_FAM_MEMBERS']].values
y=dff.iloc[:,-1].values

In [169]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test= train_test_split(X,y, test_size=.1,random_state=0)

In [170]:
from sklearn.tree import DecisionTreeClassifier
model=DecisionTreeClassifier()
model.fit(X_train,y_train)
y_predtree=model.predict(X_test)

In [171]:
acc=model.score(X_test,y_test)*100
print("acc: ",acc)

acc:  85.38123971475589

In [173]:
from sklearn.metrics import accuracy_score
accuracy=accuracy_score(y_test,y_predtree)
print(accuracy)

0.853812397147559

In [174]:
from sklearn.metrics import confusion_matrix
con=confusion_matrix(y_test,y_predtree)
print(con)

[[2951  291]
 [ 242  162]]

In [176]:
from sklearn.metrics import classification_report
report =classification_report(y_test,y_predtree)
print(report)

              precision    recall  f1-score   support

           0       0.92      0.91      0.92      3242
           1       0.36      0.40      0.38       404

    accuracy                           0.85      3646
   macro avg       0.64      0.66      0.65      3646
weighted avg       0.86      0.85      0.86      3646

In [177]:
from sklearn.ensemble import RandomForestClassifier
model= RandomForestClassifier(n_estimators=10,criterion="entropy")
model.fit(X_train,y_train)
y_pred=model.predict(X_test)

In [178]:
model.score(X_test,y_test)*100

87.16401535929786

In [179]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test,y_pred)*100

87.16401535929786

In [181]:
from sklearn.metrics import classification_report
report=classification_report(y_test,y_pred)
print(report)

              precision    recall  f1-score   support

           0       0.92      0.94      0.93      3242
           1       0.40      0.33      0.36       404

    accuracy                           0.87      3646
   macro avg       0.66      0.64      0.65      3646
weighted avg       0.86      0.87      0.87      3646